projects/rarefied-flows/impingment/sims/templates/compressible/rhoSimpleFoam/gasMixing/injectorPipe/Allrun.mesh
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication decomposePar

runParallel snappyHexMesh -overwrite

rm -rf 0

#------------------------------------------------------------------------------
